'''
2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длинаширинамасса асфальта для покрытия одного кв метра дороги асфальтом,
толщиной в 1 см*число см толщины полотна. Проверить работу метода.
Например: 20м*5000м*25кг*5см = 12500 т
'''
class Road:
    _width = None
    _length = None
    __depth = 0.05
    __asphalt = 25

    def __init__(self, length, width):
        self._width = width
        self._length = length

    def mass(self):
        return self._length * self._width * self.__asphalt * self.__depth

road = Road(length = 4000, width =25)
print(road.mass())